app/Controllers/Presence.php

    public function index()
{
    $db = \Config\Database::connect();
    $start = date('Y-m-d 00:00:00');
    $end   = date('Y-m-d 23:59:59');

    $presence = $db->table('presensidata')
        ->where('guru_id', session('id'))
        ->where('created_at >=', $start)
        ->where('created_at <=', $end)
        ->get()
        ->getResultArray();

        // print_r($presence);
        // exit();

    // pagination manual
    $perPage = 5;
    $page    = max(1, (int) ($this->request->getGet('page') ?? 1));
    $offset  = ($page - 1) * $perPage;

    $total = $db->table('presensidata')
        ->where('guru_id', session('id'))
        ->countAllResults();

    $history = $db->table('presensidata')
        ->where('guru_id', session('id'))
        ->orderBy('presensidata_tanggal', 'DESC')
        ->limit($perPage, $offset)
        ->get()
        ->getResultArray();
---
SELECT *
FROM `presensidata`
WHERE `guru_id` = '62'
AND `created_at` >= '2026-01-23 00:00:00'
AND `created_at` <= '2026-01-23 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `presensidata`
WHERE `guru_id` = '62'
SELECT *
FROM `presensidata`
WHERE `guru_id` = '62'
ORDER BY `presensidata_tanggal` DESC
 LIMIT 5

public function full_report($year = null, $month = null)
{
    $db = \Config\Database::connect();

    $year  = $year  ?? date('Y');
    $month = $month ?? date('m');

    // normalize month/year (handle <1 or >12)
    $current = strtotime(sprintf('%04d-%02d-01', $year, $month));
    $month   = (int)date('m', $current);
    $year    = (int)date('Y', $current);

    $start = date('Y-m-01', $current);
    $end   = date('Y-m-t', $current);

    $rows = $db->table('presensidata')
        ->select('DATE(presensidata_tanggal) as tgl, status')
        ->where('guru_id', session('id'))
        ->where('presensidata_tanggal >=', $start)
        ->where('presensidata_tanggal <=', $end)
        ->get()
        ->getResultArray();
---
SELECT DATE(presensidata_tanggal) as tgl, `status`
FROM `presensidata`
WHERE `guru_id` = '62'
AND `presensidata_tanggal` >= '2026-01-01'
AND `presensidata_tanggal` <= '2026-01-31'