app/Controllers/Profile.php

    public function index()
    {
        $db = \Config\Database::connect();

        $user = $db->table('users')
            ->where('id', session('id') ?? session('user_id'))
            ->get()
            ->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '62'

    public function form()
    {
        $db = \Config\Database::connect();
        $id = session()->get('id');

        $user = $db->table('users')
            ->where('id', $id)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '62'